Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/atdf/ATSAME54P19A.atdf
        <module name="SUPC" id="U2407" version="1.1.0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <signals>
              <signal group="OUT" index="0" function="SUPC" pad="PB01" ioset="1"/>
              <signal group="OUT" index="1" function="SUPC" pad="PB02" ioset="1"/>
              <signal group="VBAT" function="SUPC" pad="PB03" ioset="1"/>
            </signals>
            <parameters>
              <param name="BOD12_CALIB_MSB" value="5"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="3.0.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x40003800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04" ioset="1"/>
              <signal group="WO" index="0" function="E" pad="PA08" ioset="2"/>
              <signal group="WO" index="0" function="E" pad="PB30" ioset="3"/>
              <signal group="WO" index="1" function="E" pad="PA05" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA09" ioset="2"/>
              <signal group="WO" index="1" function="E" pad="PB31" ioset="3"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="44" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="45" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="46" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="9" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="14"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x40003C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06" ioset="1"/>
              <signal group="WO" index="0" function="E" pad="PA10" ioset="2"/>
              <signal group="WO" index="1" function="E" pad="PA07" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA11" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="47" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="48" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="49" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="9" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="15"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x4101A000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA12" ioset="2"/>
              <signal group="WO" index="0" function="E" pad="PA16" ioset="3"/>
              <signal group="WO" index="0" function="E" pad="PA00" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA01" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA13" ioset="2"/>
              <signal group="WO" index="1" function="E" pad="PA17" ioset="3"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="50" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="51" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="52" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="26" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="45"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x4101C000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18" ioset="2"/>
              <signal group="WO" index="0" function="E" pad="PA14" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA15" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA19" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="53" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="54" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="55" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="26" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="46"/>
            </parameters>
          </instance>
