Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/atdf/ATSAME54P19A.atdf
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMD51PC" caption="SAMD51PC">
      <pin position="A1" pad="PA00"/>
      <pin position="A2" pad="PB02"/>
      <pin position="A3" pad="PB00"/>
      <pin position="A4" pad="PC30"/>
      <pin position="A5" pad="PB30"/>
      <pin position="A6" pad="VSW"/>
      <pin position="A7" pad="VDDCORE"/>
      <pin position="A8" pad="RESET_N"/>
      <pin position="A9" pad="PC27"/>
      <pin position="A10" pad="PC26"/>
      <pin position="A11" pad="PC24"/>
      <pin position="A12" pad="PB28"/>
      <pin position="A13" pad="PB26"/>
      <pin position="A14" pad="PB23"/>
      <pin position="A15" pad="PB22"/>
      <pin position="B1" pad="PA01"/>
      <pin position="B2" pad="PB03"/>
      <pin position="B3" pad="PB01"/>
      <pin position="B4" pad="PC31"/>
      <pin position="B5" pad="PB31"/>
      <pin position="B6" pad="PA31"/>
      <pin position="B7" pad="PA30"/>
      <pin position="B8" pad="PA27"/>
      <pin position="B9" pad="PC28"/>
      <pin position="B10" pad="PC25"/>
      <pin position="B11" pad="PB29"/>
      <pin position="B12" pad="PB27"/>
      <pin position="B13" pad="PB25"/>
      <pin position="B14" pad="PB24"/>
      <pin position="B15" pad="PA25"/>
      <pin position="C1" pad="PC00"/>
      <pin position="C2" pad="PC01"/>
      <pin position="C14" pad="PA23"/>
      <pin position="C15" pad="PA24"/>
      <pin position="D1" pad="PC02"/>
      <pin position="D2" pad="GNDIO"/>
      <pin position="D14" pad="PA22"/>
      <pin position="D15" pad="PA21"/>
      <pin position="E1" pad="PA02"/>
      <pin position="E2" pad="PC03"/>
      <pin position="E14" pad="PA20"/>
      <pin position="E15" pad="PB21"/>
      <pin position="F1" pad="PB04"/>
      <pin position="F2" pad="PA03"/>
      <pin position="F6" pad="GNDIO"/>
      <pin position="F7" pad="VDDIO"/>
      <pin position="F8" pad="VDDIO"/>
      <pin position="F9" pad="GNDIO"/>
      <pin position="F10" pad="VDDIO"/>
      <pin position="F14" pad="PB20"/>
      <pin position="F15" pad="PB19"/>
      <pin position="G1" pad="PB05"/>
      <pin position="G2" pad="PD00"/>
      <pin position="G6" pad="VDDANA"/>
      <pin position="G10" pad="GNDIO"/>
      <pin position="G14" pad="PB18"/>
      <pin position="G15" pad="PB17"/>
      <pin position="H1" pad="PD01"/>
      <pin position="H2" pad="PB06"/>
      <pin position="H6" pad="GNDANA"/>
      <pin position="H10" pad="VDDIO"/>
      <pin position="H14" pad="PD21"/>
      <pin position="H15" pad="PB16"/>
      <pin position="J1" pad="PB07"/>
      <pin position="J2" pad="PB08"/>
      <pin position="J6" pad="GNDIO"/>
      <pin position="J10" pad="GNDIO"/>
      <pin position="J14" pad="PC23"/>
      <pin position="J15" pad="PD20"/>
      <pin position="K1" pad="PB09"/>
      <pin position="K2" pad="PA04"/>
      <pin position="K6" pad="VDDIO"/>
      <pin position="K7" pad="VDDIO"/>
      <pin position="K8" pad="GNDIO"/>
      <pin position="K9" pad="GNDIO"/>
      <pin position="K10" pad="VDDIO"/>
      <pin position="K14" pad="PC21"/>
      <pin position="K15" pad="PC22"/>
      <pin position="L1" pad="PA05"/>
      <pin position="L2" pad="PA06"/>
      <pin position="L14" pad="PC19"/>
      <pin position="L15" pad="PC20"/>
      <pin position="M1" pad="PA07"/>
      <pin position="M2" pad="VDDANA"/>
      <pin position="M14" pad="PC17"/>
      <pin position="M15" pad="PC18"/>
      <pin position="N1" pad="PC04"/>
      <pin position="N2" pad="PC05"/>
      <pin position="N14" pad="PA19"/>
      <pin position="N15" pad="PC16"/>
      <pin position="P1" pad="PC06"/>
      <pin position="P2" pad="PC07"/>
      <pin position="P3" pad="PA09"/>
      <pin position="P4" pad="PA11"/>
      <pin position="P5" pad="PB11"/>
      <pin position="P6" pad="PB13"/>
      <pin position="P7" pad="PB15"/>
      <pin position="P8" pad="PD09"/>
      <pin position="P9" pad="PD11"/>
      <pin position="P10" pad="PC10"/>
      <pin position="P11" pad="PC13"/>
      <pin position="P12" pad="PC15"/>
      <pin position="P13" pad="PA13"/>
      <pin position="P14" pad="PA17"/>
      <pin position="P15" pad="PA18"/>
      <pin position="R1" pad="PA08"/>
      <pin position="R2" pad="PA10"/>
      <pin position="R3" pad="PB10"/>
      <pin position="R4" pad="PB12"/>
      <pin position="R5" pad="PB14"/>
      <pin position="R6" pad="PD08"/>
      <pin position="R7" pad="PD10"/>
      <pin position="R8" pad="PD12"/>
      <pin position="R9" pad="PC11"/>
      <pin position="R10" pad="PC12"/>
      <pin position="R11" pad="PC14"/>
      <pin position="R12" pad="PA12"/>
      <pin position="R13" pad="PA14"/>
      <pin position="R14" pad="PA15"/>
      <pin position="R15" pad="PA16"/>
    </pinout>
    <pinout name="SAMD51P" caption="SAMD51P">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PC00"/>
      <pin position="4" pad="PC01"/>
      <pin position="5" pad="NC"/>
      <pin position="6" pad="VDDANA"/>
      <pin position="7" pad="PC02"/>
      <pin position="8" pad="PC03"/>
      <pin position="9" pad="PA02"/>
      <pin position="10" pad="PA03"/>
      <pin position="11" pad="PB04"/>
      <pin position="12" pad="PB05"/>
      <pin position="13" pad="PD00"/>
      <pin position="14" pad="GNDANA"/>
      <pin position="15" pad="VDDANA"/>
      <pin position="16" pad="PD01"/>
      <pin position="17" pad="PB06"/>
      <pin position="18" pad="PB07"/>
      <pin position="19" pad="PB08"/>
      <pin position="20" pad="PB09"/>
      <pin position="21" pad="PA04"/>
      <pin position="22" pad="PA05"/>
      <pin position="23" pad="PA06"/>
      <pin position="24" pad="PA07"/>
      <pin position="25" pad="GNDANA"/>
      <pin position="26" pad="VDDANA"/>
      <pin position="27" pad="PC04"/>
      <pin position="28" pad="PC05"/>
      <pin position="29" pad="PC06"/>
      <pin position="30" pad="PC07"/>
      <pin position="31" pad="GND"/>
      <pin position="32" pad="VDDIO"/>
      <pin position="33" pad="PA08"/>
      <pin position="34" pad="PA09"/>
      <pin position="35" pad="PA10"/>
      <pin position="36" pad="PA11"/>
      <pin position="37" pad="VDDIO"/>
      <pin position="38" pad="GND"/>
      <pin position="39" pad="PB10"/>
      <pin position="40" pad="PB11"/>
      <pin position="41" pad="PB12"/>
      <pin position="42" pad="PB13"/>
      <pin position="43" pad="PB14"/>
      <pin position="44" pad="PB15"/>
      <pin position="45" pad="GND"/>
      <pin position="46" pad="VDDIO"/>
      <pin position="47" pad="PD08"/>
      <pin position="48" pad="PD09"/>
      <pin position="49" pad="PD10"/>
      <pin position="50" pad="PD11"/>
      <pin position="51" pad="PD12"/>
      <pin position="52" pad="PC10"/>
      <pin position="53" pad="GND"/>
      <pin position="54" pad="VDDIO"/>
      <pin position="55" pad="PC11"/>
      <pin position="56" pad="PC12"/>
      <pin position="57" pad="PC13"/>
      <pin position="58" pad="PC14"/>
      <pin position="59" pad="PC15"/>
      <pin position="60" pad="PA12"/>
      <pin position="61" pad="PA13"/>
      <pin position="62" pad="PA14"/>
      <pin position="63" pad="PA15"/>
      <pin position="64" pad="GND"/>
      <pin position="65" pad="VDDIO"/>
      <pin position="66" pad="PA16"/>
      <pin position="67" pad="PA17"/>
      <pin position="68" pad="PA18"/>
      <pin position="69" pad="PA19"/>
      <pin position="70" pad="PC16"/>
      <pin position="71" pad="PC17"/>
      <pin position="72" pad="PC18"/>
      <pin position="73" pad="PC19"/>
      <pin position="74" pad="PC20"/>
      <pin position="75" pad="PC21"/>
      <pin position="76" pad="PC22"/>
      <pin position="77" pad="PC23"/>
      <pin position="78" pad="GND"/>
      <pin position="79" pad="VDDIO"/>
      <pin position="80" pad="PD20"/>
      <pin position="81" pad="PD21"/>
      <pin position="82" pad="PB16"/>
      <pin position="83" pad="PB17"/>
      <pin position="84" pad="PB18"/>
      <pin position="85" pad="PB19"/>
      <pin position="86" pad="PB20"/>
      <pin position="87" pad="PB21"/>
      <pin position="88" pad="PA20"/>
      <pin position="89" pad="PA21"/>
      <pin position="90" pad="GND"/>
      <pin position="91" pad="VDDIO"/>
      <pin position="92" pad="PA22"/>
      <pin position="93" pad="PA23"/>
      <pin position="94" pad="PA24"/>
      <pin position="95" pad="PA25"/>
      <pin position="96" pad="GND"/>
      <pin position="97" pad="VDDIO"/>
      <pin position="98" pad="PB22"/>
      <pin position="99" pad="PB23"/>
      <pin position="100" pad="PB24"/>
      <pin position="101" pad="PB25"/>
      <pin position="102" pad="PB26"/>
      <pin position="103" pad="PB27"/>
      <pin position="104" pad="PB28"/>
      <pin position="105" pad="PB29"/>
      <pin position="106" pad="GND"/>
      <pin position="107" pad="VDDIO"/>
      <pin position="108" pad="PC24"/>
      <pin position="109" pad="PC25"/>
      <pin position="110" pad="PC26"/>
      <pin position="111" pad="PC27"/>
      <pin position="112" pad="PC28"/>
      <pin position="113" pad="PA27"/>
      <pin position="114" pad="RESET_N"/>
      <pin position="115" pad="VDDCORE"/>
      <pin position="116" pad="GND"/>
      <pin position="117" pad="VSW"/>
      <pin position="118" pad="VDDIO"/>
      <pin position="119" pad="PA30"/>
      <pin position="120" pad="PA31"/>
      <pin position="121" pad="PB30"/>
      <pin position="122" pad="PB31"/>
      <pin position="123" pad="PC30"/>
      <pin position="124" pad="PC31"/>
      <pin position="125" pad="PB00"/>
      <pin position="126" pad="PB01"/>
      <pin position="127" pad="PB02"/>
      <pin position="128" pad="PB03"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>